#ifndef RK3588_IO_H
#define RK3588_IO_H

#include <stdint.h>

#define RK3588_BASE_CLOCK 25

#define SYS_GRF 0x0fd58c000

#define DEVICE_MEMORY_START 0x0f0000000
#define DEVICE_MEMORY_END 0x0ff100000

#define PCIE_DEVICE_MEMORY_START 0x900000000

#define SDMMC 0x0fe2c0000
#define SDMMC_BUF 0x0fe2f0000

// OHCI regs are at offset 0x40000
#define USB2HOST_0 0x0fc800000
#define USB2HOST_1 0x0fc880000

#define USB2PHY0_GRF 0x0fd5d0000
#define USB2PHY1_GRF 0x0fd5d4000
#define USB2PHY2_GRF 0x0fd5d8000
#define USB2PHY3_GRF 0x0fd5dc000

#define GPIO0_START 0x0fd8a0000
#define GPIO1_START 0x0fec20000
#define GPIO2_START 0x0fec30000
#define GPIO3_START 0x0fec40000
#define GPIO4_START 0x0fec50000

#define HPTIMER 0x0fd8c8000
#define TIMER_S_0 0x0fe3d0000
#define TIMER_NS_0 0x0feae0000
#define TIMER_NS_1 0x0feae8000
#define TIMER_PMU 0x0fd8f0000

#define USB3_0 0x0fc000000
#define USB3_1 0x0fc400000
#define USB3_2 0x0fcd00000

#define EDP0 0x0fdec0000
#define EDP1 0x0fded0000

#define UART0 0x0fd890000
#define UART1 0x0feb40000
#define UART2 0x0feb50000
#define UART3 0x0feb60000

#define GIC600_D 0x0fe600000
#define GIC600_R 0x0fe680000

#define PMU 0x0fd8d0000

#define PWM0 0xfd8b0000
#define PWM1 0xfebd0000
#define PWM2 0xfebe0000
#define PWM3 0xfebf0000

#define PMU0_SGRF 0x0fd580000
#define PMU1_SGRF 0x0fd582000

#define PMU1_IOC 0x0fd5f0000
#define PMU2_IOC 0x0fd5f4000
#define BUS_IOC 0x0fd5f8000
#define VCCIO3_5_IOC 0x0fd5fa000

#define HDMI_TX0 0x0fde80000

	uint32_t gpio0b_iomux_sel_h;
	uint32_t gpio0c_iomux_sel_l;
	uint32_t gpio0c_iomux_sel_h;
	uint32_t gpio0d_iomux_sel_l;
	uint32_t gpio0d_iomux_sel_h;
	uint32_t gpio0b_ds_h;
	uint32_t gpio0c_ds_l;
	uint32_t gpio0c_ds_h;
	uint32_t gpio0d_ds_l;
	uint32_t gpio0d_ds_h;
	uint32_t gpio0b_p;
	uint32_t gpio0c_p;
	uint32_t gpio0d_p;
	uint32_t gpio0b_ie;
	uint32_t gpio0c_ie;
	uint32_t gpio0d_ie;
	uint32_t gpio0b_smt;
	uint32_t gpio0c_smt;
	uint32_t gpio0d_smt;
	uint32_t gpio0b_pdis;
	uint32_t gpio0c_pdis;
	uint32_t gpio0d_pdis;
};

struct __attribute__((packed)) BusIoc {
	char pad1[0xc];
	uint32_t gpio0b_iomux_sel_h;
	uint32_t gpio0c_iomux_sel_l;
	uint32_t gpio0c_iomux_sel_h;
	uint32_t gpio0d_iomux_sel_l;
	uint32_t gpio0d_iomux_sel_h;
	uint32_t gpio1a_iomux_sel_l;
	uint32_t gpio1a_iomux_sel_h;
	uint32_t gpio1b_iomux_sel_l;
	uint32_t gpio1b_iomux_sel_h;
	uint32_t gpio1c_iomux_sel_l;
	uint32_t gpio1c_iomux_sel_h;
	uint32_t gpio1d_iomux_sel_l;
	uint32_t gpio1d_iomux_sel_h;
	uint32_t gpio2a_iomux_sel_l;
	uint32_t gpio2a_iomux_sel_h;
	uint32_t gpio2b_iomux_sel_l;
	uint32_t gpio2b_iomux_sel_h;
	uint32_t gpio2c_iomux_sel_l;
	uint32_t gpio2c_iomux_sel_h;
	uint32_t gpio2d_iomux_sel_l;
	uint32_t gpio2d_iomux_sel_h;
	uint32_t gpio3a_iomux_sel_l;
	uint32_t gpio3a_iomux_sel_h;
	uint32_t gpio3b_iomux_sel_l;
	uint32_t gpio3b_iomux_sel_h;
	uint32_t gpio3c_iomux_sel_l;
	uint32_t gpio3c_iomux_sel_h;
	uint32_t gpio3d_iomux_sel_l;
	uint32_t gpio3d_iomux_sel_h;
	uint32_t gpio4a_iomux_sel_l;
	uint32_t gpio4a_iomux_sel_h;
	uint32_t gpio4b_iomux_sel_l;
	uint32_t gpio4b_iomux_sel_h;
	uint32_t gpio4c_iomux_sel_l;
	uint32_t gpio4c_iomux_sel_h;
	uint32_t gpio4d_iomux_sel_l;
	uint32_t gpio4d_iomux_sel_h;
};
_Static_assert(__builtin_offsetof(struct BusIoc, gpio4c_iomux_sel_l) == 0x90, "Failed offset check");

struct __attribute__((packed)) Gpio {
	uint32_t swport_dr_l;
	uint32_t swport_dr_h;
	uint32_t swport_ddr_l;
	uint32_t swport_ddr_h;
	uint32_t int_en_l;
	uint32_t int_en_h;
	uint32_t int_mask_l;
	uint32_t int_mask_h;
	uint32_t int_type_l;
	uint32_t int_type_h;
	uint32_t int_polarity_l;
	uint32_t int_polarity_h;
};

struct __attribute__((packed)) Pwm {
	struct __attribute__((packed)) PwmChannel {
		uint32_t cnt;
		uint32_t period_hpr;
		uint32_t duty_lpr;
		uint32_t ctrl;
	}channels[4];
	uint32_t inststs;
	uint32_t int_en;
	uint32_t res3[2];
	uint32_t fifo_ctrl;
	uint32_t fifo_inststs;
	uint32_t fifo_toutthr;
	uint32_t version_id;
	uint32_t fifo;
	uint32_t res0[7];
	uint32_t pwrmatch_ctrl;
	uint32_t pwrmatch_lpre;
	uint32_t pwrmatch_hpre;
	uint32_t pwrmatch_ld;
	uint32_t pwrmatch_hd_zero;
	uint32_t pwrmatch_hd_on;
	uint32_t pwrmatch_value0;
	uint32_t pwrmatch_value1;
	uint32_t pwrmatch_value2;
	uint32_t pwrmatch_value3;
	uint32_t pwrmatch_value4;
	uint32_t pwrmatch_value5;
	uint32_t pwrmatch_value6;
	uint32_t pwrmatch_value7;
	uint32_t pwrmatch_value8;
	uint32_t pwrmatch_value9;
	uint8_t res1[0xc];
	uint32_t pwm3_pwrcaptur_e_value;
	uint32_t channel_io_ctrl;
};

struct __attribute__((packed)) Pdm {
	uint32_t PDM_SYSCONFIG;	 // 0x0000: PDM System Configure Register
	uint32_t PDM_CTRL0;		 // 0x0004: PDM Control Register 0
	uint32_t PDM_CTRL1;		 // 0x0008: PDM Control Register 1
	uint32_t PDM_CLK_CTRL;	  // 0x000C: PDM Clock Control Register
	uint32_t PDM_HPF_CTRL;	  // 0x0010: PDM High-pass Filter Control Register
	uint32_t PDM_FIFO_CTRL;	 // 0x0014: PDM FIFO Control Register
	uint32_t PDM_DMA_CTRL;	  // 0x0018: PDM DMA Control Register
	uint32_t PDM_INT_EN;		// 0x001C: PDM Interrupt Enable Register
	uint32_t PDM_INT_CLR;	   // 0x0020: PDM Interrupt Clear Register
	uint32_t PDM_INT_ST;		// 0x0024: PDM Interrupt Status Register
	uint32_t res1[02];
	uint32_t PDM_RXFIFO_DATA_REG; // 0x0030: PDM Receive FIFO Data Register
	uint32_t PDM_DATA0R_REG;	// 0x0034: PDM Path0 Right Channel Data Register
	uint32_t PDM_DATA0L_REG;	// 0x0038: PDM Path0 Left Channel Data Register
	uint32_t PDM_DATA1R_REG;	// 0x003C: PDM Path1 Right Channel Data Register
	uint32_t PDM_DATA1L_REG;	// 0x0040: PDM Path1 Left Channel Data Register
	uint32_t PDM_DATA2R_REG;	// 0x0044: PDM Path2 Right Channel Data Register
	uint32_t PDM_DATA2L_REG;	// 0x0048: PDM Path2 Left Channel Data Register
	uint32_t PDM_DATA3R_REG;	// 0x004C: PDM Path3 Right Channel Data Register
	uint32_t PDM_DATA3L_REG;	// 0x0050: PDM Path3 Left Channel Data Register
	uint32_t PDM_DATA_VALID;	// 0x0054: PDM Path Data Valid Register
	uint32_t PDM_VERSION;	   // 0x0058: PDM Version Register
	uint32_t reserved[233];			  // Reserved space
	uint32_t PDM_INCR_RXDR;	 // 0x0400: Increment Address Receive FIFO Data Register
};

struct __attribute__((packed)) Dwhdmi {
	uint32_t core_id;
	uint32_t ver_number;
	uint32_t ver_type;
	uint32_t config_reg;
	uint8_t res0[4];
	uint32_t core_timestamp_hhmm;
	uint32_t core_timestamp_mmdd;
	uint32_t core_timestamp_yyyy;
	uint8_t res1[32];
	uint32_t global_swreset_request;
	uint32_t global_swdisable;
	uint32_t reset_manager_config0;
	uint8_t res2[4];
	uint32_t reset_manager_status0;
	uint32_t reset_manager_status1;
	uint32_t reset_manager_status2;
	uint8_t res3[36];
	uint32_t timer_base_config0;
	uint32_t timer_base_status0;
	uint8_t res4[88];
	uint32_t i2cm_sm_scl_config0;
	uint32_t i2cm_fm_scl_config0;
	uint32_t i2cm_config0;
	uint32_t i2cm_control0;
	uint32_t i2cm_status0;
	uint32_t i2cm_interface_control0;
	uint32_t i2cm_interface_control1;
	uint32_t i2cm_interface_wrdata_0_3;
	uint32_t i2cm_interface_wrdata_4_7;
	uint32_t i2cm_interface_wrdata_8_11;
